; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image2 - mode
	infrared0 - mode
	spectrograph3 - mode
	spectrograph1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star2 - direction
	Star7 - direction
	Star6 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star7)
	(supports instrument3 image2)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
)
(:goal (and
	(have_image Star8 spectrograph3)
	(have_image Phenomenon9 image2)
	(have_image Star10 spectrograph1)
	(have_image Phenomenon11 image2)
	(have_image Phenomenon12 image2)
	(have_image Planet13 infrared0)
	(have_image Star14 spectrograph1)
	(have_image Planet15 spectrograph1)
	(have_image Star16 spectrograph1)
))

)

; plan
1. (turn_to satellite1 star6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star6)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 star6)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 phenomenon9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 9
5. (take_image satellite1 phenomenon9 instrument3 image2)
   added: (have_image phenomenon9 image2)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon12 instrument3 image2)
   added: (have_image phenomenon12 image2)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 9
9. (turn_to satellite0 star2 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star2)
   goals met: 2 of 9
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
11. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 9
12. (take_image satellite1 phenomenon11 instrument3 image2)
   added: (have_image phenomenon11 image2)
   goals met: 3 of 9
13. (turn_to satellite0 star8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star8)
   goals met: 3 of 9
14. (take_image satellite0 star8 instrument0 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 4 of 9
15. (turn_to satellite1 planet13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet13)
   goals met: 4 of 9
16. (take_image satellite1 planet13 instrument3 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 5 of 9
17. (turn_to satellite1 planet15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet15)
   goals met: 5 of 9
18. (take_image satellite1 planet15 instrument3 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 6 of 9
19. (turn_to satellite1 star10 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star10)
   goals met: 6 of 9
20. (take_image satellite1 star10 instrument3 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 7 of 9
21. (turn_to satellite1 star14 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star14)
   goals met: 7 of 9
22. (take_image satellite1 star14 instrument3 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 8 of 9
23. (turn_to satellite1 star16 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star16)
   goals met: 8 of 9
24. (take_image satellite1 star16 instrument3 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 9 of 9
